# """
# add - прибавляет два значения или конкатенирует строки
# addslashes - экранирует специальные символы с обратным слешем в строке
# capfirst - делает первую букву строки заглавной
# center - выравнивает строку по центру заданной ширины
# cut - удаляет все вхождения подстроки из строки
# date - форматирует дату или время
# default - возвращает значение по умолчанию, если переменная не определена или пустая
# default_if_none - возвращает значение по умолчанию, если переменная равна None
# dictsort - сортирует словарь по ключам
# dictsortreversed - сортирует словарь по ключам в обратном порядке
# divisibleby - проверяет, делится ли число на заданный делитель
# escape - экранирует специальные символы HTML в строке
# escapejs - экранирует специальные символы JavaScript в строке
# filesizeformat - форматирует размер файла в удобочитаемом виде
# first - возвращает первый элемент списка или первый символ строки
# floatformat - форматирует число с фиксированной точностью
# force_escape - экранирует специальные символы HTML в строке, игнорируя возможные теги
# get_digit - возвращает цифру заданного разряда числа
# iriencode - кодирует URL в соответствии со стандартами Internationalized Resource Identifier (IRI)
# join - объединяет строки или элементы списка в одну строку
# json_script - преобразует объект Python в JSON и оборачивает его в тег <script>
# last - возвращает последний элемент списка или последний символ строки
# length - возвращает длину строки или количество элементов в списке
# length_is - проверяет, имеет ли объект заданную длину
# linebreaks - заменяет переводы строк на HTML-теги <p>
# linebreaksbr - заменяет переводы строк на HTML-теги <br>
# linenumbers - добавляет номера строк к каждой строке текста
# ljust - выравнивает строку по левому краю заданной ширины
# lower - приводит строку к нижнему регистру
# make_list - преобразует аргумент в список
# phone2numeric - преобразует буквенно-цифровой номер телефона в числовой формат
# pluralize - возвращает единственное или множественное число для существительного на основе заданного числа
# pprint - форматирует и выводит структурированный вывод объекта Python
# random - возвращает случайный элемент из списка или строку
# rjust - выравнивает строку по правому краю с заданной шириной
# safe - помечает строку как безопасную для рендеринга
# safeseq - помечает последовательность как безопасную для рендеринга
# slice - возвращает срез последовательности
# slugify - преобразует строку в URL-подобный слаг
# stringformat - форматирует строку с использованием заданных параметров форматирования
# striptags - удаляет все HTML- и XML-теги из строки
# time - форматирует время в соответствии с заданным форматом
# timesince - возвращает время, прошедшее с указанной даты до текущего момента
# timeuntil - возвращает время, оставшееся до указанной даты от текущего момента
# title - преобразует строку, делая заглавными первые буквы каждого слова
# truncatechars - обрезает строку до указанного числа символов
# truncatechars_html - обрезает HTML-строку до указанного числа символов
# truncatewords - обрезает строку до указанного числа слов
# truncatewords_html - обрезает HTML-строку до указанного числа слов
# unordered_list - преобразует список или последовательность в маркированный HTML-список
# upper - приводит строку к верхнему регистру
# urlencode - кодирует строку в формате URL
# urlize - преобразует URL-ссылки в HTML-ссылки
# urlizetrunc - преобразует URL-ссылки в HTML-ссылки, обрезая их для сокращения длины
# wordcount - возвращает количество слов в строке
# wordwrap - разбивает строку на строки заданной длины
# yesno - заменяет булево значение на заданную строку в зависимости от него
#
# """